import unittest
import time
from CW import Crossword

start_time = time.time() #початок прорахування часу

crossword = Crossword() #створення об'єкту класу Crossword


#crossword.read_file('source.txt', '—')


crossword.describe = {"тригонометрія": "наука, про трикутники", "матаналіз": "наука про аналіз даних", "алгебра": "наука про обчислювання", "логіка":"мистецтво думати", "комбінаторика":"наука про випадки", "топологія":"наука про просторове уявлення", "статистика":"наука про вивчення процесів"}
crossword.name = "Науки про математику та програмування"


#crossword.generate(30, -1)

end_time = time.time() #кінець прорахування часу
print("Час генерації: ", round(end_time - start_time, 2))
crossword.best_crossword = [6, [(0, 0), (6, 0), (2, 0), (6, -5), (9, -5), (9, 4)], {(0, 0): 'а', (1, 0): 'л', (2, 0): 'г', (3, 0): 'е', (4, 0): 'б', (5, 0): 'р', (6, 0): 'а', (0, 6): 'к', (0, 5): 'о', (0, 4): 'м', (0, 3): 'б', (0, 2): 'і', (0, 1): 'н', (0, -1): 'т', (0, -2): 'о', (0, -3): 'р', (0, -4): 'и', (0, -5): 'к', (0, -6): 'а', (6, 1): 'м', (6, -1): 'т', (6, -2): 'а', (6, -3): 'н', (6, -4): 'а', (6, -5): 'л', (6, -6): 'і', (6, -7): 'з', (2, 2): 'л', (2, 1): 'о', (2, -1): 'і', (2, -2): 'к', (2, -3): 'а', (2, -5): 'т', (3, -5): 'о', (4, -5): 'п', (5, -5): 'о', (7, -5): 'о', (8, -5): 'г', (9, -5): 'і', (10, -5): 'я', (9, 6): 'т', (9, 5): 'р', (9, 4): 'и', (9, 3): 'г', (9, 2): 'о', (9, 1): 'н', (9, 0): 'о', (9, -1): 'м', (9, -2): 'е', (9, -3): 'т', (9, -4): 'р', (9, -6): 'я', (2, 4): 'с', (3, 4): 'т', (4, 4): 'а', (5, 4): 'т', (6, 4): 'и', (7, 4): 'с', (8, 4): 'т', (10, 4): 'к', (11, 4): 'а'}, {'алгебра': [(0, 0), False], 'комбінаторика': [(0, 6), True], 'матаналіз': [(6, 1), True], 'логіка': [(2, 2), True], 'топологія': [(2, -5), False], 'тригонометрія': [(9, 6), True], 'статистика': [(2, 4), False]}, 12.511774625261097]


#crossword.create_window()

crossword.draw(15)

time.sleep(5)
end_time = time.time() #кінець прорахування часу

print("Час виконання програми: ", round(end_time - start_time, 2))